myfile = open('1.txt',r);
 	在我读初中的时候，我们班分了九个组，每组六人。在这个组我有一个非常要好的朋友，
 	我们可以称呼他为jack，我们无话不说各自分享秘密。我曾认为我们会是永远的朋友，
 	知道我做了一个错误。有一天，老师把我们班重新分了组，我和他被分到了不同的组。
 	在新的小组，我认识了一个新的朋友叫做bob，我和他相谈盛欢，甚至我忘记为什么我当
 	时告诉他jack喜欢的女孩就在我们这组。显然，bob和我一样都是守不住秘密的人，他立马就
 	将这个消息告诉了周围的所有人。结果可想而知，所有人都知道了这件事情，jack自然也是知
 	道是我把这个秘密说出来的。那天下午，他拿着乒乓球拍路过我身前，然后止住了脚步，拿起
 	球拍敲打了我的头，生气的对我说不要再和他说话了。我当时脑袋一片空白，甚至忘了疼痛，
 	我看着他离开，没说一句话。我这才意识到我犯了一个大错误，这个错误使我失去了我的好朋友。
 	之后的一个月我们没有说话，我一度认为我们不可能再成为朋友了。直到又一次我和他乘坐了
 	一辆客车，凑巧的是我就做他旁边，我忘记了是谁先开始说的话，但我们一直聊到客车抵达终点站。
 	现在，这是我认识他的第十年，我相信我们会是永远的朋友。从那件事情之后，我知道有些事情，
 	我们不能开玩笑，当一个人愿意对你说一些别人不知道的事情，那他肯定把你当做是好朋友。